class ListViewItems {
  String image;
  String name;
  String description;
  ListViewItems({this.image, this.name, this.description});
}

List<ListViewItems> items = [
  ListViewItems(
    image: 'assets/images/item1.jpg',
    name: 'فندق بغداد الدولي',
    description:
        'أن فدق بغداد الدولي هو الفندق الوحيد في الشرق الاوسط الذي لايمكن للمواطن النزول فيه ن فدق بغداد الدولي هو الفندق الوحيد في الشرق الاوسط الذي لايمكن للمواطن النزول فيه ن فدق بغداد الدولي هو الفندق الوحيد في الشرق الاوسط الذي لايمكن للمواطن النزول فيه',
  ),
  ListViewItems(
      image: 'assets/images/item2.jpg',
      name: 'شركة المنامة للسيارات',
      description:
          'أن شركة المنامة للسيارات هي الشركة الرائدة في الشرق الاوسط في بيع وشراء السياراتن شركة المنامة للسيارات هي الشركة الرائدة في الشرق الاوسط في بيع وشراء السيارات ن شركة المنامة للسيارات هي الشركة الرائدة في الشرق الاوسط في بيع وشراء السيارات '),
  ListViewItems(
      image: 'assets/images/item3.jpg',
      name: 'مختبر النخبة للتحليلات المرضية',
      description:
          ' أن مختبر النخبة هو المختبر الرائد في الشرق الاوسط في التحليلات المرضية أن مختبر النخبة هو المختبر الرائد في الشرق الاوسط في التحليلات المرضية ن مختبر النخبة هو المختبر الرائد في الشرق الاوسط في التحليلات المرضية أن مختبر النخبة هو المختبر الرائد في الشرق الاوسط في التحليلات المرضية'),
  ListViewItems(
    image: 'assets/images/item4.jpg',
    name: 'شركة الثقة للاستشارات الهندسية',
    description:
        'أن شركة الثقة هي الشركة الوحيدة التي تقدم خدمات حول العالم ن شركة الثقة هي الشركة الوحيدة التي تقدم خدمات حول العالمن شركة الثقة هي الشركة الوحيدة التي تقدم خدمات حول العالم',
  ),
  ListViewItems(
      image: 'assets/images/item5.jpg',
      name: 'مول الواحة',
      description:
          'أن مول الواحة هو مول لكل العوائل فيه ما يحتاجه كل فرد ن مول الواحة هو مول لكل العوائل فيه ما يحتاجه كل فردن مول الواحة هو مول لكل العوائل فيه ما يحتاجه كل فردن مول الواحة هو مول لكل العوائل فيه ما يحتاجه كل فرد'),
  ListViewItems(
      image: 'assets/images/item6.jpg',
      name: ' شركة التقنية للكهربائيات',
      description:
          'أن شركة التقنية للكهربائيات هي الشركة الرائدة في الشرق الاوسط في انتاج المواد الكهربائية ن شركة التقنية للكهربائيات هي الشركة الرائدة في الشرق الاوسط في انتاج المواد الكهربائيةن شركة التقنية للكهربائيات هي الشركة الرائدة في الشرق الاوسط في انتاج المواد الكهربائيةن شركة التقنية للكهربائيات هي الشركة الرائدة في الشرق الاوسط في انتاج المواد الكهربائية'),
];

class OnBoardingScreenClass {
  var image;
  String title;
  String description;
  OnBoardingScreenClass({this.image, this.title, this.description});
}

List<OnBoardingScreenClass> views = [
  OnBoardingScreenClass(
    image: 'assets/images/13.png',
    title: 'ماجلانو ميديا',
    description:
        'هي احدى فروع شركة ماجلانو متخصصة في كافة الاعلانانات التجاريةوالخطط التسويقية',
  ),
  OnBoardingScreenClass(
    image: 'assets/images/12.jpg',
    title: 'ليش تحتاج هوية بصرية ؟',
    description:
        'هويتك البصرية راح تحدد قيمتك السوقية بين المنافسين وتبرز امكانياتك وقيمتك بالسوق  ',
  ),
  OnBoardingScreenClass(
    image: 'assets/images/11.png',
    title: 'ماجلانو ميديا ',
    description:
        'كل مايتعلق بالتسويق الالكتروني وصناعة المحتوى الجذاب والهادف لصفحتك والنشر والترويج                                         ',
  ),
];
